R/aphia.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:aph="http://aphia/v1.0/AphiaID">
   <soapenv:Header/>
   <soapenv:Body>
      <aph:getAphiaID soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <scientificname xsi:type="xsd:string">?</scientificname>
         <marine_only xsi:type="xsd:boolean">false</marine_only>
      </aph:getAphiaID>
   </soapenv:Body>
</soapenv:Envelope>